Revit 2027 API
BuiltInFailures.BendFailures.NotBentSymbol Property
 While making curved beam type "[Type Name]" Symbol elements were not created
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotBentSymbol { get; }
Public Shared ReadOnly Property NotBentSymbol As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotBentSymbol {
	FailureDefinitionId^ get ();
}
static member NotBentSymbol : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.BendFailures Class
Autodesk.Revit.DB Namespace